---
kind: type
id: T:Autodesk.Revit.DB.DimensionSegmentArrayIterator
source: html/493650c6-0c1f-2a56-7aeb-0d29d2ae3911.htm
---
# Autodesk.Revit.DB.DimensionSegmentArrayIterator

An iterator to an array of DimensionSegment objects..

## Syntax (C#)
```csharp
public abstract class DimensionSegmentArrayIterator : APIObject,
	IEnumerator
```